# ⚪️ Planned changes ([link](https://castillo-a.app.spacelift.io/stack/spacelift-admin/run/01HMHM09TJ524GEAN428WNG8FD))
![add](https://img.shields.io/badge/add-2-brightgreen) ![change](https://img.shields.io/badge/change-1-yellow) ![destroy](https://img.shields.io/badge/destroy-0-red)
| Action | Resource | Changes |
| --- | --- | --- |
| Added | `spacelift_aws_integration.this` | <details><summary>Value</summary>`{"duration_seconds": 3600, "external_id": null, "generate_credentials_in_worker": false, "labels": null, "name": "spacelift-prod-integration", "role_arn": "arn:aws:iam::231172330323:role/spacelift-prod-integration", "space_id": "spacelift-01HMFXPMNB91WQDPJ1M4X8AB3A"}`</details> |
| Added | `spacelift_aws_integration_attachment.aws001-prod` | <details><summary>Value</summary>`{"module_id": null, "read": true, "stack_id": "aws001-prod", "write": true}`</details> |
| Changed | `spacelift_context.spacelift` | <details><summary>New value</summary>`{"after_apply": [], "after_destroy": [], "after_init": [], "after_perform": [], "after_plan": [], "after_run": [], "before_apply": [], "before_destroy": [], "before_init": [], "before_perform": [], "before_plan": [], "description": "Configuration details for spaclift context.", "id": "spacelift-context", "labels": ["autoattach:spacelift"], "name": "spacelift-context", "space_id": "spacelift-01HMFXPMNB91WQDPJ1M4X8AB3A"}`</details> |

>_⚠️ Changes will be deployed after merging PR. New comment will show results after merge._

## Planning logs

```
[01HMHBQENP45HA5D4TZ4E0EADH] Planning changes with 0 custom hooks...
spacelift_space.spacelift: Refreshing state... [id=spacelift-01HMFXPMNB91WQDPJ1M4X8AB3A]
spacelift_policy.github: Refreshing state... [id=github-comment-notification]
spacelift_policy.pr-only: Refreshing state... [id=pr-only-push]
spacelift_space.prod: Refreshing state... [id=prod-01HMHFW2VF5M8HPKJXSHPKJJT9]
spacelift_context.spacelift: Refreshing state... [id=spacelift-context]
spacelift_environment_variable.prod-role-name: Refreshing state... [id=context/spacelift-context/TF_VAR_prod_role_name]
spacelift_environment_variable.prod-account: Refreshing state... [id=context/spacelift-context/TF_VAR_prod_account]
spacelift_context.prod: Refreshing state... [id=prod-context]
spacelift_stack.aws001-prod: Refreshing state... [id=terraform-aws001-prod]
spacelift_environment_variable.environment: Refreshing state... [id=context/prod-context/TF_VAR_environment]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # spacelift_aws_integration.this will be created
  + resource "spacelift_aws_integration" "this" {
      + duration_seconds               = 3600
      + generate_credentials_in_worker = false
      + id                             = (known after apply)
      + name                           = "*****"
      + role_arn                       = "arn:aws:iam::*****:role/*****"
      + space_id                       = "spacelift-01HMFXPMNB91WQDPJ1M4X8AB3A"
    }

  # spacelift_aws_integration_attachment.aws001-prod will be created
  + resource "spacelift_aws_integration_attachment" "aws001-prod" {
      + attachment_id  = (known after apply)
      + id             = (known after apply)
      + integration_id = (known after apply)
      + read           = true
      + stack_id       = "aws001-prod"
      + write          = true
    }

  # spacelift_context.spacelift will be updated in-place
  ~ resource "spacelift_context" "spacelift" {
        id             = "spacelift-context"
        name           = "spacelift-context"
      ~ space_id       = "root" -> "spacelift-01HMFXPMNB91WQDPJ1M4X8AB3A"
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

[01HMHBQENP45HA5D4TZ4E0EADH] Changes are GO
[01HMHBQENP45HA5D4TZ4E0EADH] Uploading the list of managed resources...
[01HMHBQENP45HA5D4TZ4E0EADH] Please be aware that the run changes calculation includes output changes.
[01HMHBQENP45HA5D4TZ4E0EADH] Resource list upload is GO
[01HMHBQENP45HA5D4TZ4E0EADH] Generating JSON representation of the plan...
[01HMHBQENP45HA5D4TZ4E0EADH] JSON representation is GO
[01HMHBQENP45HA5D4TZ4E0EADH] Loading custom plan policy inputs...
[01HMHBQENP45HA5D4TZ4E0EADH] 0 custom plan policy inputs found
[01HMHBQENP45HA5D4TZ4E0EADH] No plan policies to evaluate
```
